----------------------------------------------------------
-- AI相关的通用定义，包括常量等
----------------------------------------------------------

-- ******************************************************
-- ai常量，各种AI相关的常量在这里定义
-- ******************************************************
g_ai_const = {
	-- 追击类型
	AI_CONST_CHASE_TYPE_THREATEN		= 0,	--恐吓时追击（追击到恐吓范围）
	AI_CONST_CHASE_TYPE_ATTACK			= 1,	--攻击时追击（追击到当前技能的攻击范围）
    AI_CONST_CHASE_TYPE_ATTACK_CD		= 2,	--攻击CD时追击（追击到指定距离）
	
	-- 行动间隔计时器类型
	AI_CONST_TIMER_TYPE_ATTACK_CD		= 0,	--攻击CD计时器
	AI_CONST_TIMER_TYPE_DISRUPT			= 1,	--扰敌计时器
	
	AI_CONST_CHASE_COOLDOWN				= 500,		--追击冷却时间
}